## Pandas: Concat Dataframes

In [5]:
import pandas as pd
us_weather = pd.DataFrame({
    "city": ['New York','California','Washington'],
    "temperature": [32, 28, 45,],
    "humidity": [ 80, 75, 60, ]
})
us_weather = pd.DataFrame({
    "city": ['New York','California','Washington'],
    "temperature": [32, 28, 45,],
    "humidity": [ 80, 75, 60, ]
})
cn_weather = pd.DataFrame({
    "city": ['ShangHai','Linyi','Tibet'],
    "temperature": [33, 24, 44,],
    "humidity": [ 60, 90, 55, ]
})
gn_weather = pd.DataFrame({
    "city": ['Conakry','Labe','Nzerekore'],
    "temperature": [40, 38, 21,],
    "humidity": [ 30, 65, 92, ]
})

In [2]:
us_weather

         city  temperature  humidity
0    New York           32        80
1  California           28        75
2  Washington           45        60

In [3]:
cn_weather

       city  temperature  humidity
0  ShangHai           33        60
1     Linyi           24        90
2     Tibet           44        55

In [4]:
gn_weather

        city  temperature  humidity
0    Conakry           40        30
1       Labe           38        65
2  Nzerekore           21        92

In [6]:
data = pd.concat([gn_weather, us_weather])
data

         city  temperature  humidity
0     Conakry           40        30
1        Labe           38        65
2   Nzerekore           21        92
0    New York           32        80
1  California           28        75
2  Washington           45        60

In [7]:
data = pd.concat([gn_weather, us_weather], ignore_index=True)
data

         city  temperature  humidity
0     Conakry           40        30
1        Labe           38        65
2   Nzerekore           21        92
3    New York           32        80
4  California           28        75
5  Washington           45        60

In [9]:
data = pd.concat([gn_weather, us_weather], keys=["Guinea", "USA"])
data

                city  temperature  humidity
Guinea 0     Conakry           40        30
       1        Labe           38        65
       2   Nzerekore           21        92
USA    0    New York           32        80
       1  California           28        75
       2  Washington           45        60

In [10]:
data.loc['Guinea']

        city  temperature  humidity
0    Conakry           40        30
1       Labe           38        65
2  Nzerekore           21        92

In [11]:
data.loc['USA']

         city  temperature  humidity
0    New York           32        80
1  California           28        75
2  Washington           45        60

In [18]:
temperature_us = pd.DataFrame({
    "city": ['New York','California','Washington'],
    "temperature": [32, 28, 45,],
})
temperature_us

         city  temperature
0    New York           32
1  California           28
2  Washington           45

In [19]:
windspeed_us  = pd.DataFrame({
    "city": ['California','Washington'],
    "windspeed": [7, 9, ]
})
windspeed_us

         city  windspeed
0  California          7
1  Washington          9

In [20]:
concat = pd.concat([temperature_us, windspeed_us])
concat

         city  temperature  windspeed
0    New York         32.0        NaN
1  California         28.0        NaN
2  Washington         45.0        NaN
0  California          NaN        7.0
1  Washington          NaN        9.0

In [21]:
concat = pd.concat([temperature_us, windspeed_us], axis =1)
concat

         city  temperature        city  windspeed
0    New York           32  California        7.0
1  California           28  Washington        9.0
2  Washington           45         NaN        NaN

In [22]:
temperature_us = pd.DataFrame({
    "city": ['New York','California','Washington'],
    "temperature": [32, 28, 45,],
}, index=[0,1,2])
temperature_us

         city  temperature
0    New York           32
1  California           28
2  Washington           45

In [23]:
windspeed_us  = pd.DataFrame({
    "city": ['California','Washington'],
    "windspeed": [7, 9, ]
}, index=[1,2])
windspeed_us

         city  windspeed
1  California          7
2  Washington          9

In [24]:
concat = pd.concat([temperature_us, windspeed_us], axis =1)
concat

         city  temperature        city  windspeed
0    New York           32         NaN        NaN
1  California           28  California        7.0
2  Washington           45  Washington        9.0

In [25]:
temperature_us

         city  temperature
0    New York           32
1  California           28
2  Washington           45

In [27]:
s = pd.Series(['Humid', 'dry', 'rain'], name="event")
s

0    Humid
1      dry
2     rain
Name: event, dtype: object

In [28]:
concat = pd.concat([temperature_us, s], axis=1)
concat

         city  temperature  event
0    New York           32  Humid
1  California           28    dry
2  Washington           45   rain